jmeter/results/report_100/statistics.json
{
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 1000,
    "errorCount" : 810,
    "errorPct" : 81.0,
    "meanResTime" : 9052.658999999989,
    "medianResTime" : 10001.0,
    "minResTime" : 377.0,
    "maxResTime" : 10007.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10003.0,
    "throughput" : 7.711170401443531,
    "receivedKBytesPerSec" : 16.793106767901484,
    "sentKBytesPerSec" : 0.3476804076510233
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2600,
    "errorCount" : 1356,
    "errorPct" : 52.153847,
    "meanResTime" : 4531.411923076929,
    "medianResTime" : 200.5,
    "minResTime" : 0.0,
    "maxResTime" : 10007.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 20.04904304375318,
    "receivedKBytesPerSec" : 26.759146893940564,
    "sentKBytesPerSec" : 2.2109823211779585
  },
  "Login for Token" : {
    "transaction" : "Login for Token",
    "sampleCount" : 300,
    "errorCount" : 246,
    "errorPct" : 82.0,
    "meanResTime" : 9091.910000000007,
    "medianResTime" : 10001.0,
    "minResTime" : 435.0,
    "maxResTime" : 10003.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 5.026051701318501,
    "receivedKBytesPerSec" : 11.061534841009232,
    "sentKBytesPerSec" : 0.21468701310124144
  },
  "GET /restaurants?q=ramen" : {
    "transaction" : "GET /restaurants?q=ramen",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9600000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 33.69045212586753,
    "receivedKBytesPerSec" : 19.31278847449633,
    "sentKBytesPerSec" : 4.507414005120949
  },
  "POST /reviews/" : {
    "transaction" : "POST /reviews/",
    "sampleCount" : 300,
    "errorCount" : 300,
    "errorPct" : 100.0,
    "meanResTime" : 1.5966666666666667,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 5.072365751386447,
    "receivedKBytesPerSec" : 0.9962443358582443,
    "sentKBytesPerSec" : 1.6068105492526714
  }
}