jmeter/results/report_300/statistics.json
{
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 3000,
    "errorCount" : 3000,
    "errorPct" : 100.0,
    "meanResTime" : 10001.337999999989,
    "medianResTime" : 10001.0,
    "minResTime" : 10000.0,
    "maxResTime" : 10013.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10003.0,
    "throughput" : 18.775346718069393,
    "receivedKBytesPerSec" : 49.12026743916788,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 7800,
    "errorCount" : 4800,
    "errorPct" : 61.53846,
    "meanResTime" : 5001.132179487199,
    "medianResTime" : 5015.5,
    "minResTime" : 0.0,
    "maxResTime" : 10013.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 48.81590146698042,
    "receivedKBytesPerSec" : 75.74128882585241,
    "sentKBytesPerSec" : 4.156612403306965
  },
  "Login for Token" : {
    "transaction" : "Login for Token",
    "sampleCount" : 900,
    "errorCount" : 900,
    "errorPct" : 100.0,
    "meanResTime" : 10001.215555555551,
    "medianResTime" : 10001.0,
    "minResTime" : 10000.0,
    "maxResTime" : 10007.0,
    "pct1ResTime" : 10002.0,
    "pct2ResTime" : 10002.0,
    "pct3ResTime" : 10002.0,
    "throughput" : 10.020821039270484,
    "receivedKBytesPerSec" : 26.216581605669557,
    "sentKBytesPerSec" : 0.0
  },
  "GET /restaurants?q=ramen" : {
    "transaction" : "GET /restaurants?q=ramen",
    "sampleCount" : 3000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8783333333333332,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 50.16470745614769,
    "receivedKBytesPerSec" : 28.75652663745966,
    "sentKBytesPerSec" : 6.711489181144759
  },
  "POST /reviews/" : {
    "transaction" : "POST /reviews/",
    "sampleCount" : 900,
    "errorCount" : 900,
    "errorPct" : 100.0,
    "meanResTime" : 1.2088888888888873,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 11.27763019397524,
    "receivedKBytesPerSec" : 2.246715390206005,
    "sentKBytesPerSec" : 3.2929799101548793
  }
}