jmeter/results/report_400/statistics.json
{
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 4000,
    "errorCount" : 4000,
    "errorPct" : 100.0,
    "meanResTime" : 10001.941750000005,
    "medianResTime" : 10002.0,
    "minResTime" : 10000.0,
    "maxResTime" : 10012.0,
    "pct1ResTime" : 10003.0,
    "pct2ResTime" : 10003.0,
    "pct3ResTime" : 10003.0,
    "throughput" : 25.02486846303514,
    "receivedKBytesPerSec" : 65.47033458249135,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10400,
    "errorCount" : 6400,
    "errorPct" : 61.53846,
    "meanResTime" : 5001.417596153871,
    "medianResTime" : 5009.0,
    "minResTime" : 0.0,
    "maxResTime" : 10012.0,
    "pct1ResTime" : 10003.0,
    "pct2ResTime" : 10003.0,
    "pct3ResTime" : 10003.0,
    "throughput" : 65.06465800389137,
    "receivedKBytesPerSec" : 100.95237220112486,
    "sentKBytesPerSec" : 5.540173516181706
  },
  "Login for Token" : {
    "transaction" : "Login for Token",
    "sampleCount" : 1200,
    "errorCount" : 1200,
    "errorPct" : 100.0,
    "meanResTime" : 10001.737500000003,
    "medianResTime" : 10002.0,
    "minResTime" : 10000.0,
    "maxResTime" : 10010.0,
    "pct1ResTime" : 10003.0,
    "pct2ResTime" : 10003.0,
    "pct3ResTime" : 10003.0,
    "throughput" : 13.35321478645984,
    "receivedKBytesPerSec" : 34.93482657512296,
    "sentKBytesPerSec" : 0.0
  },
  "GET /restaurants?q=ramen" : {
    "transaction" : "GET /restaurants?q=ramen",
    "sampleCount" : 4000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8749999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 66.82035347966992,
    "receivedKBytesPerSec" : 38.304245598209214,
    "sentKBytesPerSec" : 8.93983244796365
  },
  "POST /reviews/" : {
    "transaction" : "POST /reviews/",
    "sampleCount" : 1200,
    "errorCount" : 1200,
    "errorPct" : 100.0,
    "meanResTime" : 1.159166666666668,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 15.025919711502342,
    "receivedKBytesPerSec" : 2.993444942525857,
    "sentKBytesPerSec" : 4.387451165760938
  }
}